app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("created_at", "todo", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-06-12 20:18:53.468198"], ["todo", "smd"], ["updated_at", "2014-06-12 20:18:53.468198"], ["user_id", 1]]
UPDATE "tasks" SET "updated_at" = ?, "user_id" = ? WHERE "tasks"."id" = 4  [["updated_at", "2014-06-12 00:37:01.782511"], ["user_id", 1]]
---
	def create
		@task = current_user.tasks.create(params[:task].permit(:todo))
		@task.user_id = current_user.id
		@task.save

SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."user_id" = ? AND "tasks"."id" = ? LIMIT 1  [["user_id", 1], ["id", 2]]
---
	def edit
		@task = current_user.tasks.find(params[:id])

SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."user_id" = ? AND "tasks"."id" = ? LIMIT 1  [["user_id", 1], ["id", 3]]
UPDATE "tasks" SET "todo" = ?, "updated_at" = ? WHERE "tasks"."id" = 1  [["todo", "finish this project nao"], ["updated_at", "2014-06-11 23:18:52.086899"]]
---
	def update
		@task = current_user.tasks.find(params[:id])
		@task.update_attributes(params[:task].permit(:todo))

SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."user_id" = ? AND "tasks"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 3]]
---
	def destroy
		@task = current_user.tasks.find(params[:id])
		@task.destroy