app/controllers/users_controller.rb

	def create
		@user = User.create(params[:user].permit(:email, :password))
---
INSERT INTO "users" ("created_at", "email", "password", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-06-11 23:57:22.478404"], ["email", "blah@blah"], ["password", "pass"], ["updated_at", "2014-06-11 23:57:22.478404"]]

	def update
		@user = current_user
		if((params[:user][:email].include? "@") && (params[:user][:password] != "") && (params[:user][:password] != nil))
			@user.update_attributes(params[:user].permit(:email, :password))
---
UPDATE "users" SET "email" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["email", "ff@ff"], ["password", "ff"], ["updated_at", "2014-06-12 21:21:13.940449"]]